002_karman/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    IN
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       23740;
    }
    WALL
    {
        type            symmetry;
        inGroups        List<word> 1(wall);
        nFaces          280;
        startFace       23820;
    }
    OUT
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       24100;
    }
    WALL_CIR
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       24180;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          24000;
        startFace       24260;
    }
)

// ************************************************************************* //
